# SetValue Method (Int32)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ScheduleFilter..::..SetValue Method (Int32)
ScheduleFilter Class See Also
---
Set the filter value to an integer.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public void SetValue(
	int value
)
```

Visual Basic
---
```text
Public Sub SetValue ( _
	value As Integer _
)
```

Visual C++
---
```text
public:
void SetValue(
	int value
)
```

# ### Parameters
value
    Type: System..::..Int32 The filter value.
# See Also
ScheduleFilter Class
SetValue Overload
Autodesk.Revit.DB Namespace